import React from 'react';
import "../css/kame.css"

function PrivacyPolicy() {
  return (
    <div>
      <p className='kame_font_002'>プライバシーポリシー</p>
      <p>
        Deep Stream アプリケーション（以下「本アプリケーション」といいます）の利用において、関西学院大学軽音サークル「Deep Stream」（以下「当サークル」といいます）は、ユーザーの個人情報を適切に取り扱うためのプライバシーポリシーを以下の通り定めます。ユーザーは本プライバシーポリシーに同意した上で、本アプリケーションを利用してください。
      </p>
      <p>1. 取得する情報</p>
      <p>
        当サークルは、本アプリケーションの利用にあたり、以下の情報を取得します：<br/>
        - メールアドレス<br/>
        - 氏名<br/>
        - ニックネーム<br/>
        - 学籍番号
      </p>
      <p>2. 情報の利用目的</p>
      <p>
        当サークルは、ユーザーの情報を以下の目的で利用します：<br/>
        - アプリケーション内の機能提供および運営管理<br/>
        - イベントのお知らせや重要な情報の連絡<br/>
        - ユーザーサポートや問い合わせ対応<br/>
        - 匿名統計データの作成および分析
      </p>
      <p>3. 情報の共有</p>
      <p>
        当サークルは、ユーザーの個人情報を第三者と共有することはありません。ただし、法的要求や法的手続きへの対応、利用規約の違反や不正行為の調査、当サークルの権利や財産の保護など、適用される法律や規制に基づく場合には、必要な範囲内で情報を開示することがあります。
      </p>
      <p>4. 情報の保護と管理</p>
      <p>
        当サークルは、ユーザーの情報を適切に保護するために、適切なセキュリティ対策を実施します。情報の不正アクセス、紛失、改ざん、漏洩などを防止するために努力いたします。
      </p>
      <p>5. Cookieの利用</p>
      <p>
        本アプリケーションでは、ユーザーエクスペリエンスの向上やサービスの提供に関連する目的で、Cookieを使用する場合があります。Cookieはユーザーのウェブブラウザに保存される情報であり、個人を特定するものではありません。ユーザーはブラウザの設定によってCookieの利用を制御することができます。
      </p>
      <p>6. 外部リンク</p>
      <p>
        本アプリケーションは、第三者のウェブサイトやサービスへのリンクを含む場合があります。当サークルはリンク先のウェブサイトやサービスにおけるプライバシー保護やデータ取扱いについて責任を負いません。リンク先のサイトやサービスのプライバシーポリシーをご確認ください。
      </p>
      <p>7. 利用規約との関係</p>
      <p>
        本プライバシーポリシーは、本アプリケーションの利用に関連する個人情報の取扱いについて定めたものであり、利用規約と併せて適用されます。
      </p>
      <p>8. プライバシーポリシーの変更</p>
      <p>
        当サークルは、必要に応じて本プライバシーポリシーを変更する権利を有します。変更されたプライバシーポリシーは、本アプリケーション内に掲示されることで効力を生じます。
      </p>
      <p>9. お問い合わせ</p>
      <p>
        プライバシーポリシーに関するご質問やお問い合わせがある場合は、以下の連絡先までお気軽にご連絡ください：<br/>
        [deepstream.ksc [ at ] gmail.com]
      </p>
    </div>
  );
}

export default PrivacyPolicy;
