import React from 'react';
import "../css/kame.css"

function TermsOfUse() {
  return (
    <div>
      <p className='kame_font_002'>Deep Stream アプリケーション利用規約</p>
      <p>
        この利用規約（以下「本規約」といいます）は、関西学院大学軽音サークル「Deep Stream」（以下「当サークル」といいます）が提供するアプリケーションの利用に関する条件を定めるものです。本規約は、利用者（以下「ユーザー」といいます）と当サークルとの間の関係を定めるものですので、ユーザーは本規約に同意した上で、当サークルのアプリケーションを利用してください。
      </p>

      <p>1. 利用者情報の取得</p>
      <p>
        1.1 当サークルのアプリケーションを利用するにあたり、ユーザーは以下の情報を提供する必要があります：
        <ul>
          <li>メールアドレス</li>
          <li>氏名</li>
          <li>ニックネーム</li>
          <li>学籍番号</li>
        </ul>
      </p>
      <p>
        1.2 ユーザーが提供した情報は、当サークルによって適切に管理され、プライバシーおよび個人情報保護に関する法律および当サークルのプライバシーポリシーに従って処理されます。
      </p>

      <p>2. アプリケーションの利用</p>
      <p>
        2.1 当サークルのアプリケーションは、部室予約、イベントのスケジュール確認、提出書類の確認など、当サークルの活動に関連する機能を提供します。
      </p>
      <p>
        2.2 ユーザーは、本アプリケーションを個人的な目的で利用することができます。営利目的での利用や第三者への情報の提供は禁止されています。
      </p>

      <p>3. 利用規約の変更</p>
      <p>
        当サークルは、必要に応じて本規約を変更する権利を有します。変更された利用規約は、本アプリケーション内に掲示されることで効力を生じます。ユーザーは定期的に利用規約を確認し、最新の内容に同意するものとします。
      </p>

      <p>4. 免責事項</p>
      <p>
        4.1 当サークルは、本アプリケーションの利用によって生じたいかなる損害についても責任を負いません。
      </p>
      <p>
        4.2 当サークルは、予告なしに本アプリケーションの提供を中止または中断する権利を有します。また、本アプリケーションの利用によってユーザーに生じた損害についても責任を負いません。
      </p>

      <p>5. 知的財産権</p>
      <p>
        5.1 当サークルは、本アプリケーションに関する一切の知的財産権を保有しています。
      </p>
      <p>
        5.2 ユーザーは、本アプリケーションの利用に際して当サークルの知的財産権を侵害する行為を行ってはなりません。
      </p>

      <p>6. 準拠法および管轄裁判所</p>
      <p>
        本規約の解釈にあたっては、日本法を準拠法とします。本規約に関する紛争については、関西学院大学所在地を管轄する裁判所を専属的合意管轄裁判所とします。
      </p>

      <p>7. その他の規定</p>
      <p>
        本規約に定める以外の事項については、当サークルのプライバシーポリシーおよびアプリケーション内のルールやガイドラインなどが適用されます。
      </p>
    </div>
  );
}

export default TermsOfUse;
